//[x] Задание 13.Сделайте сценарий работы с корзиной
//Сделайте сценарий для добавления товаров в корзину и удаления товаров из корзины.

//1) открыть главную страницу
//2) открыть первый товар из списка
//2) добавить его в корзину (при этом может случайно добавиться товар,
//который там уже есть, ничего страшного)
//3) подождать, пока счётчик товаров в корзине обновится
//4) вернуться на главную страницу, повторить предыдущие шаги ещё два раза,
//чтобы в общей сложности в корзине было 3 единицы товара
//5) открыть корзину(в правом верхнем углу кликнуть по ссылке Checkout)
//6) удалить все товары из корзины один за другим, после каждого удаления подождать,
//пока внизу обновится таблица

//Можно оформить сценарий либо как тест, либо как отдельный исполняемый файл.
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SeleniumWebDriverCourse.Task13_ActionsWithBusket
{
    internal class ActionsWithBusket
    {
    }
}
